test/thorium-artillery.yaml
config:
  target: https://api-stage.usatoday.com/thorium # Endpoint to performance test
  environments: # Environment the test is running
    production:
      phases:
        - duration: 3 # The total test duration
          arrivalRate: 10 # RPS
scenarios:
  - name: homepage-summary
    flow:
    - post:
        url: /elections/results/fragments/embedHomePageSummary?electionDate=2020-11-03&site-code=USAT&includeHeader=true
  - name: summary-bop
    flow:
    - post:
        url: /elections/results/fragments/embedSummaryBOP?electionDate=2020-11-03&site-code=USAT&includeHeader=true
  - name: key-races
    flow:
    - post:
        url: /elections/results/fragments/keyRaces?electionDate=2020-11-03&site-code=PIND